# Кортежи и их применение

Кортежи удобно использовать, когда необходимо вернуть из функции несколько значений:
```python
def foo():
    i = 1
    j = 2
    return i, j


result = foo()
print(result)
> (1, 2)
print(type(result))
> <class 'tuple'>
```

Свойства кортежей в `Python`:
- Неизменяемость
- Более высокая производительность по сравнению со списком

Больше информации об оптимизациях кортежей можно найти [здесь](https://stackoverflow.com/questions/68630/are-tuples-more-efficient-than-lists-in-python/22140115#22140115).

**Замечание**: в кортежах можно модифицировать изменяемые объекты
```python
some_tuple = ("123", [1, 2, 3], "456")
some_tuple[1].append(4)
print(some_tuple)
> ('123', [1, 2, 3, 4], '456')
```

## Создание кортежа в `Python`

### 1 способ: литеральное объявление
```python
some_tuple = ('abc', 'cde') # 1 вариант: в скобочках через запятую
print(some_tuple)
> ('abc', 'cde')

other_tuple = 123, 456 # 2 вариант: через запятую
print(other_tuple)
> (123, 456)
```

**Замечание**: не всегда значения в скобочках являются кортежами
```python
some_tuple = (123)
type(some_tuple)
> <class 'int'>

some_tuple = (123,)
type(some_tuple)
> <class 'tuple'>

some_tuple = (456)
type(some_tuple)
> <class 'int'>

some_tuple = (456,)
type(some_tuple)
> <class 'tuple'>
```

### 2 способ: с помощью функции `tuple()`
```python
some_tuple = tuple([10, 20, 30]) # любой итерируемый объект
print(some_tuple)
> (10, 20, 30)
```

## Взаимодействие с кортежами

Здесь описана, не самая очевидная функциональность кортежей.

### Распаковка
```python
a, _, c = (1, 2, 3) # символ _ используется для игнорирования значения в кортеже
print(a, c)
> 1 3
```

### Обращение по индексу
```python
some_tuple = ('a', 'b', 'c')
print(some_tuple[1])
> b
```

### Срез
```python
some_tuple = (10, 20, 30, 40, 50, 60)
print(some_tuple[1:-2])
> (20, 30, 40)
```

### Конкатенация
```python
some_tuple = (10, 20)
other_tuple = ('a', 'b')
print(some_tuple + other_tuple)
> (10, 20, 'a', 'b')
```

### Повторение
```python
some_tuple = (10, 20) * 3
print(some_tuple)
> (10, 20, 10, 20, 10, 20)
```

## Интересные факты
Все пустые кортежи ссылаются на один и тот же объект, в отличие от списков:
```python
some_tuple = ()
other_tuple = ()
print(some_tuple is other_tuple)
> True
print(id(some_tuple) == id(other_tuple))
> True

some_list = []
other_list = []
print(some_list is other_list)
> False
print(id(some_list) == id(other_list))
> False
```
